[EGT_CombatEngineer X2AbilityTemplate]
LocFriendlyName="Combat Engineer"
LocLongDescription="Prevents environmental damage from falling off from the center of an explosion, meaning you will destroy objects in a larger area."
LocHelpText="Prevents environmental damage from falling off from the center of an explosion, meaning you will destroy objects in a larger area."
LocFlyOverText="Combat Engineer"
LocPromotionPopupText="<Bullet/> Prevents environmental damage from falling off from the center of an explosion, meaning you will destroy objects in a larger area.</br>"

[EGT_TandemWarheads X2AbilityTemplate]
LocFriendlyName="Tandem Warheads"
LocLongDescription="Your grenades and rockets do full damage to units to the maximum extent of their area of effect."
LocHelpText="Your grenades and rockets do full damage to the maximum extent of their area of effect."
LocFlyOverText="Tandem Warheads"
LocPromotionPopupText="<Bullet/> Your grenades and rockets do full damage to units to the maximum extent of their area of effect.<br/><Bullet/> This does not apply to environmental damage."
